#+STARTUP: align shrink indent

Notas y ejercicios de mi paso por el curso de *Machine Learning* de Andrew Ng en Coursera. https://www.coursera.org/learn/machine-learning

* Log simple


| Fecha            | Horas | Actividad                                                     | Notas |
|                  |       | <20>                                                          |       |
|------------------+-------+---------------------------------------------------------------+-------|
| [2020-03-29 dom] |  1:00 | Comienzo. Creo carpetas para ir guardando las cosas           |       |
| [2020-03-30 lun] |  3:00 | S1. Comienzo notas y semana 1.                                |       |
| [2020-04-04 sáb] |  5:30 | S1. Model and cost function, Parameter learning.              |       |
| [2020-04-05 dom] |  1:20 | S1. Algebra review.                                           |       |
| [2020-04-06 lun] | 01:10 | S2. Multivariate linear regression hasta Feature scaling      |       |
| [2020-04-08 mié] | 02:30 | S2. Mv. linear regression y Computing parameters analitically |       |
| [2020-04-09 jue] | 01:00 | S2: Octave/Matlab tutorial.                                   |       |
| [2020-04-11 sáb] | 04:00 | S2: Programming assignment: linear regression.                |       |
| [2020-04-14 mar] | 02:00 | S2: Completo notas.                                           |       |
| [2020-04-16 jue] | 02:00 | S3. Classification and representation.                        |       |
| [2020-04-17 vie] | 02:00 | S3. Classification and representation. Decision boundary.     |       |
| [2020-04-17 vie] | 00:40 | S2. Pienso en Feature scaling.                                |       |
| [2020-04-17 vie] | 00:20 | S3. Logistic regression model.                                |       |
| [2020-04-18 sáb] | 01:30 | S2. Reviso notas y sigo pensando en feature scaling.          |       |
| [2020-04-18 sáb] | 01:10 | S3. Logistic regression model.                                |       |
| [2020-04-18 sáb] | 00:30 | S3. Multiclass classification. Review.                        |       |
| [2020-04-18 sáb] | 02:00 | S3. Solving the problem of overfitting.                       |       |
| [2020-04-19 dom] | 03:30 | S3. Programming assignment y completo notas.                  |       |
| [2020-04-21 mar] | 01:40 | S4. Review cosas S3. S4: Motivations, Neural Networks         |       |
|------------------+-------+---------------------------------------------------------------+-------|
|                  | 36:50 |                                                               |       |
#+TBLFM: $2=vsum(@2..@-1);U



---------------

Compartido bajo [[https://creativecommons.org/licenses/by/4.0/legalcode][CC BY 4.0]]

